app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password_digest`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)
---
def create
  @user = User.new(user_params)
  if @user.save